TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
/**
  ******************************************************************************
  * @file    crypto.c
  * @brief   sid_pal_crypto module implementation for STM32WBAxx MCUs
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>

/* Sidewalk interfaces */
#include <sid_pal_assert_ifc.h>
#include <sid_pal_crypto_ifc.h>
#include <sid_pal_log_ifc.h>

/* Platform-specific headers */
#include "app_conf.h"
#include <cmsis_os.h>
#include <crc_ctrl.h>
#include <hw.h>
#include <stm32wbaxx_hal.h>

/* Crypto library */
#include "cmox_crypto.h"

/* Utilities and helpers */
#include <sid_stm32_common_utils.h>

/* Private defines -----------------------------------------------------------*/

#define AES_KEY_SZ (16u)
#define BUFF_SIZE  (2200u) /*!< Size of the working buffer for the crypto library. This amount of RAM is reserved exclusively for the cryptography needs */

#define SID_PAL_CRYPTO_CRC_HWADDR (CRC) /*!< Physical address of the CRC to use */

/* Private variables ---------------------------------------------------------*/

static bool hal_init_done;

/* ECC context */
static cmox_ecc_handle_t ecc_ctx;
/* ECC working buffer */
SID_STM32_ALIGN_4BYTES(static uint8_t working_buffer[BUFF_SIZE]); /* CMOX buffer hast to be aligned to 4-byte boundary due to the use of alignment-sensitive assembly instructions */
/* Temporary storage for CRC peripheral register to allow shared usage of CRC */
static CRC_TypeDef hcrc_context_storage;

/* Private constants ---------------------------------------------------------*/

/* x25519 curve basepoint as per specification */
static const uint8_t x25519_base_point[CMOX_ECC_CURVE25519_PUBKEY_LEN] = {
    0x09u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
};

/* Private function prototypes -----------------------------------------------*/

static        sid_error_t        stm32wba_crypto_init(void);
static        sid_error_t        stm32wba_crypto_deinit(void);
static inline sid_error_t        stm32wba_crypto_obtain_hw_control(void);
static inline void               stm32wba_crypto_release_hw_control(void);
static        sid_error_t        stm32wba_crypto_rand(uint8_t * const rand, const size_t size);
static        cmox_hash_retval_t stm32wba_crypto_hash(sid_pal_hash_params_t * const params);
static        sid_error_t        stm32wba_crypto_hmac(sid_pal_hmac_params_t * const params);
static        sid_error_t        stm32wba_crypto_aes_crypt(sid_pal_aes_params_t * const params);
static        sid_error_t        stm32wba_crypto_aead_crypt(sid_pal_aead_params_t *params);
static        cmox_hash_retval_t get_hash_ecc_dsa_input(const sid_pal_dsa_params_t * const in_params,
                                                        sid_pal_dsa_params_t * const out_params,
                                                        uint8_t * const hash,
                                                        const size_t hash_size);
static        cmox_ecc_retval_t  do_ecc_dsa_verify(const sid_pal_dsa_params_t * const params);
static        cmox_ecc_retval_t  do_ecc_dsa_sign(sid_pal_dsa_params_t * const params);
static        cmox_ecc_retval_t  do_x25519_keygen(cmox_ecc_handle_t * const P_pEccCtx,
                                                  const uint8_t * const     P_pRandom,
                                                  const size_t              P_RandomLen,
                                                  uint8_t * const           P_pPrivKey,
                                                  size_t * const            P_pPrivKeyLen,
                                                  uint8_t * const           P_pPubKey,
                                                  size_t * const            P_pPubKeyLen);
static        cmox_ecc_retval_t  do_ecc_key_gen(sid_pal_ecc_key_gen_params_t * const params);
static        sid_error_t        stm32wba_crypto_ecc_dsa(sid_pal_dsa_params_t * const params);
static        sid_error_t        stm32wba_crypto_ecc_ecdh(sid_pal_ecdh_params_t * const params);
static        sid_error_t        stm32wba_crypto_ecc_key_gen(sid_pal_ecc_key_gen_params_t * const params);

/* Private function definitions ----------------------------------------------*/

static sid_error_t stm32wba_crypto_init(void)
{
    cmox_init_retval_t cmox_ret;

    /* Initialize cryptographic library */
    cmox_ret = cmox_initialize(NULL);
    if (cmox_ret != CMOX_INIT_SUCCESS)
    {
        return SID_ERROR_GENERIC;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

static sid_error_t stm32wba_crypto_deinit(void)
{
    cmox_init_retval_t cmox_ret;

    cmox_ret = cmox_finalize(NULL);
    if (cmox_ret != CMOX_INIT_SUCCESS)
    {
        return SID_ERROR_GENERIC;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t stm32wba_crypto_obtain_hw_control(void)
{
    sid_error_t err;

    do
    {
        /* Lock CRC to avoid concurrent access by multiple users */
        const CRCCTRL_Cmd_Status_t crc_lock_status = CRCCTRL_MutexTake();
        if (crc_lock_status != CRCCTRL_OK)
        {
            SID_PAL_LOG_ERROR("Unable to lock CRC access: %d", (int32_t)crc_lock_status);
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        /* Store original registers of the CRC unit */
        hcrc_context_storage.DR   = SID_PAL_CRYPTO_CRC_HWADDR->DR;
        hcrc_context_storage.IDR  = SID_PAL_CRYPTO_CRC_HWADDR->IDR;
        hcrc_context_storage.INIT = SID_PAL_CRYPTO_CRC_HWADDR->INIT;
        hcrc_context_storage.CR   = SID_PAL_CRYPTO_CRC_HWADDR->CR;
        hcrc_context_storage.POL  = SID_PAL_CRYPTO_CRC_HWADDR->POL;
        __COMPILER_BARRIER();

