TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
        /* Configure CRC for CMOX library */
        SID_PAL_CRYPTO_CRC_HWADDR->INIT = DEFAULT_CRC_INITVALUE;
        SID_PAL_CRYPTO_CRC_HWADDR->POL  = DEFAULT_CRC32_POLY;
        SID_PAL_CRYPTO_CRC_HWADDR->IDR  = 0u;
        SID_PAL_CRYPTO_CRC_HWADDR->CR   = CRC_POLYLENGTH_32B | CRC_CR_RESET;
        __COMPILER_BARRIER();

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void stm32wba_crypto_release_hw_control(void)
{
    /* Restore Data Register */
    SID_PAL_CRYPTO_CRC_HWADDR->INIT = hcrc_context_storage.DR;
    SID_PAL_CRYPTO_CRC_HWADDR->CR   = CRC_CR_RESET;
    __COMPILER_BARRIER();

    /* Restore the rest of the registers - this is required to keep compatibility with CRC_CTRL module */
    SID_PAL_CRYPTO_CRC_HWADDR->IDR  = hcrc_context_storage.IDR;
    SID_PAL_CRYPTO_CRC_HWADDR->INIT = hcrc_context_storage.INIT;
    SID_PAL_CRYPTO_CRC_HWADDR->POL  = hcrc_context_storage.POL;
    SID_PAL_CRYPTO_CRC_HWADDR->CR   = hcrc_context_storage.CR;
    __COMPILER_BARRIER();

    /* Release CRC access lock */
    (void)CRCCTRL_MutexRelease();
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t stm32wba_crypto_rand(uint8_t * const rand, const size_t size)
{
    size_t    remaining_bytes = size;
    uint8_t * current_pos = rand;

    while (remaining_bytes > 0u)
    {
        /* Wait for HW_RNG to populate the pool of random data */
        HW_RNG_WaitPoolIsFull();

        if (remaining_bytes >= sizeof(uint32_t))
        {
            /* HW_RNG cannot provide more than CFG_HW_RNG_POOL_SIZE words at a time, get as many words as we can */
            uint8_t words_to_process = (remaining_bytes / sizeof(uint32_t)) % (CFG_HW_RNG_POOL_SIZE + 1u);

            HW_RNG_Get(words_to_process, (uint32_t *)(void *)current_pos);

            /* Update counters and pointers */
            current_pos     += (words_to_process * sizeof(uint32_t));
            remaining_bytes -= (words_to_process * sizeof(uint32_t));
        }
        else
        {
            /* Less than 4 bytes remaining, generate one random word and copy the necessary amount of bytes */
            uint32_t random32bit;

            HW_RNG_Get(1u, &random32bit);
            SID_STM32_UTIL_fast_memcpy(current_pos, &random32bit, remaining_bytes);

            /* Done */
            remaining_bytes = 0u;
        }
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static cmox_hash_retval_t stm32wba_crypto_hash(sid_pal_hash_params_t * const params)
{
    cmox_hash_algo_t   cmox_hash_algo;
    cmox_hash_retval_t retval;
    sid_error_t        sid_err;
    size_t             expected_digest_size;

    switch(params->algo)
    {
        case SID_PAL_HASH_SHA256:
            cmox_hash_algo = CMOX_SHA256_ALGO;
            expected_digest_size = CMOX_SHA256_SIZE;
            break;

    case SID_PAL_HASH_SHA512:
        cmox_hash_algo = CMOX_SHA512_ALGO;
        expected_digest_size = CMOX_SHA512_SIZE;
        break;

    default:
        return CMOX_HASH_ERR_BAD_PARAMETER;
    }

    SID_PAL_ASSERT(expected_digest_size == params->digest_size);
    sid_err = stm32wba_crypto_obtain_hw_control();
    if (sid_err != SID_ERROR_NONE)
    {
        return CMOX_ECC_ERR_INTERNAL;
    }
    retval = cmox_hash_compute(cmox_hash_algo,                  /* Use the selected algorithm */
                               params->data, params->data_size, /* Message to digest */
                               params->digest,                  /* Data buffer to receive digest data */
                               expected_digest_size,            /* Expected digest size */
                               &(params->digest_size));         /* Size of computed digest */
    stm32wba_crypto_release_hw_control();

    return retval;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t stm32wba_crypto_hmac(sid_pal_hmac_params_t * const params)
{
    cmox_mac_retval_t retval;
    sid_error_t       sid_err;
    cmox_mac_algo_t   algo;
    size_t            expected_len;

    switch(params->algo)
    {
        case SID_PAL_HASH_SHA256:
            algo = CMOX_HMAC_SHA256_ALGO;
            expected_len = CMOX_SHA256_SIZE;
            break;

        case SID_PAL_HASH_SHA512:
            algo = CMOX_HMAC_SHA512_ALGO;
            expected_len = CMOX_SHA512_SIZE;
            break;
        default:
            return SID_ERROR_NOSUPPORT;
    }

    sid_err = stm32wba_crypto_obtain_hw_control();
    if (sid_err != SID_ERROR_NONE)
    {
        return sid_err;
    }
    /* Compute directly the authentication tag passing all the needed parameters */
    retval = cmox_mac_compute(algo,                            /* Use selected HMAC algorithm */
                              params->data, params->data_size, /* Message to authenticate */
                              params->key, params->key_size,   /* HMAC Key to use */
                              NULL, 0,                         /* Custom data */
                              params->digest,                  /* Data buffer to receive generated authentication tag */
                              expected_len,                    /* Expected authentication tag size */
                              &(params->digest_size));         /* Generated tag size */
    stm32wba_crypto_release_hw_control();

    if (retval != CMOX_MAC_SUCCESS)
    {
        return SID_ERROR_GENERIC;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t stm32wba_crypto_aes_crypt(sid_pal_aes_params_t * const params)
{
    cmox_cipher_algo_t algo = NULL;
    cmox_mac_algo_t cmac_algo = NULL;
    size_t key_size_bits = 0u;

    switch (params->algo)
    {
        case SID_PAL_AES_CMAC_128:
             cmac_algo = CMOX_CMAC_AES_ALGO;
            key_size_bits = 128u;
            break;

        case SID_PAL_AES_CTR_128:
            algo = SID_PAL_CRYPTO_DECRYPT == params->mode ? CMOX_AES_CTR_DEC_ALGO : CMOX_AES_CTR_ENC_ALGO;
            key_size_bits = 128u;
            break;

        default:
            return SID_ERROR_NOSUPPORT;
    }

