TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
    if ((params->algo == SID_PAL_AES_CTR_128) && (params->iv_size != AES_KEY_SZ))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    if (key_size_bits != params->key_size)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    switch (params->mode)
    {
        case SID_PAL_CRYPTO_ENCRYPT:
            {
                cmox_cipher_retval_t retval;
                sid_error_t          sid_err;

                sid_err = stm32wba_crypto_obtain_hw_control();
                if (sid_err != SID_ERROR_NONE)
                {
                    return sid_err;
                }
                retval = cmox_cipher_encrypt(algo,                                 /* Use AES CBC algorithm */
                                             params->in, params->in_size,          /* Plaintext to encrypt */
                                             params->key, (params->key_size / 8u), /* AES key to use */
                                             params->iv, params->iv_size,          /* Initialization vector */
                                             params->out, &(params->out_size));    /* Data buffer to receive generated ciphertext */
                stm32wba_crypto_release_hw_control();

                if (retval != CMOX_CIPHER_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("aes_encrypt[%d %d]. CMOX err: 0x%08x", params->algo, params->mode, retval);
                    return SID_ERROR_GENERIC;
                }
            }
            break;

        case SID_PAL_CRYPTO_DECRYPT:
            {
                cmox_cipher_retval_t retval;
                sid_error_t          sid_err;

                sid_err = stm32wba_crypto_obtain_hw_control();
                if (sid_err != SID_ERROR_NONE)
                {
                    return sid_err;
                }
                retval = cmox_cipher_decrypt(algo,                   /* Use AES CBC algorithm */
                               params->in, params->in_size,          /* Ciphertext to decrypt */
                               params->key, (params->key_size / 8u), /* AES key to use */
                               params->iv, params->iv_size,          /* Initialization vector */
                               params->out, &(params->out_size));    /* Data buffer to receive generated plaintext */
                stm32wba_crypto_release_hw_control();

                if (retval != CMOX_CIPHER_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("aes_decrypt[%d %d]. CMOX err: 0x%08x", params->algo, params->mode, retval);
                    return SID_ERROR_GENERIC;
                }
            }
            break;

        case SID_PAL_CRYPTO_MAC_CALCULATE:
            {
                cmox_mac_retval_t retval;
                sid_error_t       sid_err;

                sid_err = stm32wba_crypto_obtain_hw_control();
                if (sid_err != SID_ERROR_NONE)
                {
                    return sid_err;
                }
                retval = cmox_mac_compute(cmac_algo,              /* Use AES CMAC algorithm */
                            params->in, params->in_size,          /* Message to authenticate */
                            params->key, (params->key_size / 8u), /* AES key to use */
                            NULL, 0u,          /* Custom data */
                            params->out,                          /* Data buffer to receive generated authnetication tag */
                            AES_KEY_SZ,                           /* Expected authentication tag size */
                            &(params->out_size));                 /* Generated tag size */
                stm32wba_crypto_release_hw_control();

                if (retval != CMOX_MAC_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("aes_mac_compute[%d %d]. CMOX err: 0x%08x", params->algo, params->mode, retval);
                    return SID_ERROR_GENERIC;
                }
            }
            break;

        default:
            return SID_ERROR_INVALID_ARGS;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t stm32wba_crypto_aead_crypt(sid_pal_aead_params_t *params)
{
    sid_error_t status = SID_ERROR_GENERIC;
    cmox_cipher_retval_t retval;
    cmox_aead_algo_t algo;
    size_t key_size_bits = 0;

    switch (params->algo)
    {
        case SID_PAL_AEAD_GCM_128:
            algo = SID_PAL_CRYPTO_ENCRYPT == params->mode ? CMOX_AES_GCM_ENC_ALGO : CMOX_AES_GCM_DEC_ALGO;
            key_size_bits = 128u;
            break;

        case SID_PAL_AEAD_CCM_128:
        case SID_PAL_AEAD_CCM_STAR_128:
            algo = SID_PAL_CRYPTO_ENCRYPT == params->mode ? CMOX_AES_CCM_ENC_ALGO : CMOX_AES_CCM_DEC_ALGO;
            key_size_bits = 128u;
            break;

        default:
            return SID_ERROR_NOSUPPORT;
    }

    if (key_size_bits != params->key_size)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    switch (params->mode)
    {
        case SID_PAL_CRYPTO_ENCRYPT:
            {
                const size_t expected_mac_size = params->mac_size;
                const size_t expected_out_size = params->in_size;
                size_t       computed_size;
                sid_error_t  sid_err;

                if ((expected_out_size + expected_mac_size) > sizeof(working_buffer))
                {
                    SID_PAL_LOG_ERROR("AEAD encryption: cannot process data, working buffer is too small. Data size: %u", expected_out_size + expected_mac_size);
                    return SID_ERROR_BUFFER_OVERFLOW;
                }

                sid_err = stm32wba_crypto_obtain_hw_control();
                if (sid_err != SID_ERROR_NONE)
                {
                    return sid_err;
                }
                retval = cmox_aead_encrypt(algo,                                 /* Use selected AES algorithm */
                                           params->in, params->in_size,          /* Plaintext to encrypt */
                                           expected_mac_size,                    /* Authentication tag size */
                                           params->key, (params->key_size / 8u), /* AES key to use */
                                           params->iv, params->iv_size,          /* Initialization vector */
                                           params->aad, params->aad_size,        /* Additional authenticated data */
                                           working_buffer, &(computed_size));    /* Data buffer to receive generated ciphertext
                                                                                    and authentication tag */
                stm32wba_crypto_release_hw_control();

                /* Verify API returned value */
                if (retval != CMOX_CIPHER_SUCCESS)
                {
                    return SID_ERROR_ENCRYPTION_FAIL;
                }

                /* Verify generated data size is the expected one */
                if (computed_size != (expected_out_size + expected_mac_size))
                {
                    return SID_ERROR_ENCRYPTION_FAIL;
                }

