TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
                SID_STM32_UTIL_fast_memcpy(params->out, working_buffer, expected_out_size);
                params->out_size = expected_out_size;

                if (params->mac != NULL)
                {
                    SID_STM32_UTIL_fast_memcpy(params->mac, &(working_buffer[expected_out_size]), expected_mac_size);
                    params->mac_size = expected_mac_size;
                }

                status = SID_ERROR_NONE;
            }
            break;

        case SID_PAL_CRYPTO_DECRYPT:
            {
                const size_t total_in_size     = params->in_size + params->mac_size;
                const size_t expected_out_size = params->in_size;
                sid_error_t  sid_err;

                if (expected_out_size > sizeof(working_buffer))
                {
                    SID_PAL_LOG_ERROR("AEAD decryption: cannot process data, working buffer is too small. Data size: %u", expected_out_size);
                    return SID_ERROR_BUFFER_OVERFLOW;
                }

                SID_STM32_UTIL_fast_memcpy(working_buffer, params->in, params->in_size);
                SID_STM32_UTIL_fast_memcpy(&(working_buffer[params->in_size]), params->mac, params->mac_size);

                sid_err = stm32wba_crypto_obtain_hw_control();
                if (sid_err != SID_ERROR_NONE)
                {
                    return sid_err;
                }
                retval = cmox_aead_decrypt(algo,                                 /* Use selected AES algorithm */
                                           working_buffer, total_in_size,        /* Ciphertext + tag to decrypt and verify */
                                           params->mac_size,                     /* Authentication tag size */
                                           params->key, (params->key_size / 8u), /* AES key to use */
                                           params->iv, params->iv_size,          /* Initialization vector */
                                           params->aad, params->aad_size,        /* Additional authenticated data */
                                           params->out, &(params->out_size));    /* Data buffer to receive generated plaintext */
                stm32wba_crypto_release_hw_control();

                /* Verify API returned value */
                if (retval != CMOX_CIPHER_AUTH_SUCCESS)
                {
                    return SID_ERROR_ENCRYPTION_FAIL;
                }

                /* Verify generated data size is the expected one */
                if (params->out_size != expected_out_size)
                {
                    return SID_ERROR_ENCRYPTION_FAIL;
                }

                status = SID_ERROR_NONE;
            }
            break;

        default:
            status = SID_ERROR_INVALID_ARGS;
            break;
    }

    return status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static cmox_hash_retval_t get_hash_ecc_dsa_input(const sid_pal_dsa_params_t * const in_params,
                                                                           sid_pal_dsa_params_t * const out_params,
                                                                           uint8_t * const hash,
                                                                           const size_t hash_size)
{
    cmox_hash_retval_t ret = CMOX_HASH_ERR_INTERNAL;

    if (in_params->algo == SID_PAL_ECDSA_SECP256R1)
    {
        sid_pal_hash_params_t hash_params = {
            .data           = in_params->in,
            .data_size      = in_params->in_size,
            .digest         = hash,
            .digest_size    = hash_size,
            .algo           = SID_PAL_HASH_SHA256,
        };
        ret = stm32wba_crypto_hash(&hash_params);
        if (ret != CMOX_HASH_SUCCESS)
        {
            return ret;
        }
        *out_params  = *in_params;
        out_params->in = hash;
        out_params->in_size = hash_size;
    }
    else
    {
        *out_params  = *in_params;
        ret = CMOX_HASH_SUCCESS;
    }

    return ret;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static cmox_ecc_retval_t do_ecc_dsa_verify(const sid_pal_dsa_params_t * const params)
{
    cmox_ecc_retval_t retval = CMOX_ECC_ERR_INTERNAL;
    cmox_hash_retval_t hretval;
    uint8_t hash_digest[CMOX_SHA256_SIZE];
    sid_pal_dsa_params_t compat_params;

    switch (params->algo)
    {
        case SID_PAL_EDDSA_ED25519:
            cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));
            retval = cmox_eddsa_verify(&ecc_ctx,                            /* ECC context */
                                       CMOX_ECC_CURVE_ED25519,              /* ED25519 ECC curve selected */
                                       params->key, params->key_size,       /* Public key for verification */
                                       params->in, params->in_size,         /* Message to verify */
                                       params->signature, params->sig_size, /* Data buffer to receive signature */
                                       NULL);
            cmox_ecc_cleanup(&ecc_ctx);
            break;

        case SID_PAL_ECDSA_SECP256R1:
            hretval = get_hash_ecc_dsa_input(params, &compat_params, hash_digest, sizeof(hash_digest));
            if (hretval != CMOX_HASH_SUCCESS)
            {
                SID_PAL_LOG_ERROR("Hash calculation. CMOX err: 0x%08x", retval);
                return CMOX_ECC_ERR_INTERNAL;
            }

            cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));
            retval = cmox_ecdsa_verify(&ecc_ctx,                                        /* ECC context */
                                       CMOX_ECC_CURVE_SECP256R1,                        /* SECP256R1 ECC curve selected */
                                       compat_params.key, compat_params.key_size,       /* Public key for verification */
                                       compat_params.in, compat_params.in_size,         /* Message to verify */
                                       compat_params.signature, compat_params.sig_size, /* Data buffer to receive signature */
                                       NULL);
            cmox_ecc_cleanup(&ecc_ctx);
            break;

        default:
            retval = CMOX_ECC_ERR_BAD_PARAMETERS;
            break;
    }

    return retval;
}

