TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static cmox_ecc_retval_t do_ecc_dsa_sign(sid_pal_dsa_params_t * const params)
{
    cmox_ecc_retval_t retval = CMOX_ECC_ERR_INTERNAL;
    cmox_hash_retval_t hretval;
    uint8_t hash_digest[CMOX_SHA256_SIZE];
    sid_pal_dsa_params_t compat_params;
    uint8_t random_data[CMOX_SHA256_SIZE];
    sid_error_t rand_status;
    uint8_t eddsa_priv_key[CMOX_ECC_ED25519_PRIVKEY_LEN];
    size_t prk_size = 0;
    size_t puk_size = 0;

    switch (params->algo)
    {
        case SID_PAL_EDDSA_ED25519:
            cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));

            /* Data buffer to receive signature */
            if ( (CMOX_ECC_ED25519_PRIVKEY_LEN - CMOX_ECC_ED25519_PUBKEY_LEN) == params->key_size)
            {
                /* Calculate public key */
                uint8_t * p_out_prk = (uint8_t*)eddsa_priv_key;
                uint8_t * p_out_puk = (uint8_t*)eddsa_priv_key + (CMOX_ECC_ED25519_PRIVKEY_LEN - CMOX_ECC_ED25519_PUBKEY_LEN);
                retval = cmox_eddsa_keyGen(&ecc_ctx,
                                           CMOX_ECC_CURVE_ED25519,
                                           params->key, CMOX_ECC_ED25519_PRIVKEY_LEN - CMOX_ECC_ED25519_PUBKEY_LEN,
                                           p_out_prk, &prk_size,
                                           p_out_puk, &puk_size);
            }
            else if (CMOX_ECC_ED25519_PRIVKEY_LEN == params->key_size)
            {
                /* Copy privkey and pubkey to buffer */
                SID_STM32_UTIL_fast_memcpy(eddsa_priv_key, params->key, CMOX_ECC_ED25519_PRIVKEY_LEN);
                retval = CMOX_ECC_SUCCESS;
            }
            else
            {
                retval = CMOX_ECC_ERR_BAD_PARAMETERS;
            }

            if(CMOX_ECC_SUCCESS == retval)
            {
                retval = cmox_eddsa_sign(&ecc_ctx,                                      /* ECC context */
                                         CMOX_ECC_CURVE_ED25519,                        /* ED25519 ECC curve selected */
                                         eddsa_priv_key, CMOX_ECC_ED25519_PRIVKEY_LEN,  /* Private key for signature */
                                         params->in, params->in_size,                   /* Message to sign */
                                         params->signature, &params->sig_size);
            }

            cmox_ecc_cleanup(&ecc_ctx);
            break;

        case SID_PAL_ECDSA_SECP256R1:
            hretval = get_hash_ecc_dsa_input(params, &compat_params, hash_digest, sizeof(hash_digest));
            if (hretval != CMOX_HASH_SUCCESS)
            {
                SID_PAL_LOG_ERROR("Hash calculation. CMOX err: 0x%08x", retval);
                return CMOX_ECC_ERR_INTERNAL;
            }

            do
            {
                rand_status = stm32wba_crypto_rand(random_data, sizeof(random_data));
                if (rand_status != SID_ERROR_NONE)
                {
                    SID_PAL_LOG_ERROR("Random data creation failed. Error code: %d", rand_status);
                    return CMOX_ECC_ERR_INTERNAL;
                }

                cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));
                retval = cmox_ecdsa_sign(&ecc_ctx,                                          /* ECC context */
                                         CMOX_ECC_CURVE_SECP256R1,                          /* SECP256R1 ECC curve selected */
                                         random_data, sizeof(random_data),                  /* Random data buffer */
                                         compat_params.key, compat_params.key_size,         /* Private key for signature */
                                         compat_params.in, compat_params.in_size,           /* Message to sign */
                                         compat_params.signature, &compat_params.sig_size); /* Data buffer to receive signature */
                cmox_ecc_cleanup(&ecc_ctx);
            } while (CMOX_ECC_ERR_WRONG_RANDOM == retval);
            break;

        default:
            retval = CMOX_ECC_ERR_BAD_PARAMETERS;
            break;
    }

    return retval;
}

/*----------------------------------------------------------------------------*/

/**
  * @brief      Generate private and public keys to use with x25519
  * @param[in]  P_pEccCtx       Context for ECC operations
  * @param[in]  P_pRandom       Buffer of random bytes
  * @param[in]  P_RandomLen     Byte length of the random buffer
  * @param[out] P_pPrivKey      Buffer with the private key
  * @param[out] P_pPrivKeyLen   Byte length of the private key
  * @param[out] P_pPubKey       Buffer with the public key
  * @param[out] P_pPubKeyLen    Byte length of the public key
  * @retval     CMOX_ECC_SUCCESS                Everything OK
  * @retval     CMOX_ECC_ERR_INTERNAL           Systematic code failure, something is wrong with the implementation
  * @retval     CMOX_ECC_ERR_MATHCURVE_MISMATCH Mathematical function set is not compatible with current ECC curve
  * @retval     CMOX_ECC_ERR_BAD_PARAMETERS     Some NULL/wrong/empty parameter or Construct API not called
  * @retval     CMOX_ECC_ERR_WRONG_RANDOM       Random material too short or not valid for the functionality
  * @retval     CMOX_ECC_ERR_MEMORY_FAIL        Not enough memory
  */
SID_STM32_SPEED_OPTIMIZED static cmox_ecc_retval_t do_x25519_keygen(cmox_ecc_handle_t * const P_pEccCtx,
                                                                   const uint8_t * const     P_pRandom,
                                                                   const size_t              P_RandomLen,
                                                                   uint8_t * const           P_pPrivKey,
                                                                   size_t * const            P_pPrivKeyLen,
                                                                   uint8_t * const           P_pPubKey,
                                                                   size_t * const            P_pPubKeyLen)
{
    cmox_ecc_retval_t retval = CMOX_ECC_ERR_INTERNAL;
    bool wrong_random;

    /* Validate pointers */
    if (NULL == P_pEccCtx)
    {
        retval = CMOX_ECC_ERR_BAD_PARAMETERS;
        goto exit;
    }

    if (NULL == P_pRandom)
    {
        retval = CMOX_ECC_ERR_BAD_PARAMETERS;
        goto exit;
    }

