TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
    if ((NULL == P_pPrivKey) || (NULL == P_pPrivKeyLen))
    {
        retval = CMOX_ECC_ERR_BAD_PARAMETERS;
        goto exit;
    }

    if ((NULL == P_pPubKey) || (NULL == P_pPubKeyLen))
    {
        retval = CMOX_ECC_ERR_BAD_PARAMETERS;
        goto exit;
    }

    /* Ensure the random data has correct length */
    if (P_RandomLen != CMOX_ECC_CURVE25519_PRIVKEY_LEN)
    {
        retval = CMOX_ECC_ERR_WRONG_RANDOM;
        goto exit;
    }

    /* Check if random data consists of all zeros */
    wrong_random = true;
    for(size_t i = 0u; i < P_RandomLen; i++)
    {
        if (P_pRandom[i] != 0x00u)
        {
            wrong_random = false;
            break;
        }
    }
    if (wrong_random != false)
    {
        retval = CMOX_ECC_ERR_WRONG_RANDOM;
        goto exit;
    }

    /* Check if random data consists of all ones */
    wrong_random = true;
    for(size_t i = 0u; i < P_RandomLen; i++)
    {
        if (P_pRandom[i] != 0xFFu)
        {
            wrong_random = false;
            break;
        }
    }
    if (wrong_random != false)
    {
        retval = CMOX_ECC_ERR_WRONG_RANDOM;
        goto exit;
    }

    /* Now we can proceed with key generation procedure */

    /* Do x25519 clamping of the random data to obtain the private key */
    SID_STM32_UTIL_fast_memcpy(P_pPrivKey, P_pRandom, P_RandomLen);
    P_pPrivKey[0] &= 0xF8u;
    P_pPrivKey[P_RandomLen - 1] &= 0x7Fu;
    P_pPrivKey[P_RandomLen - 1] |= 0x40u;
    *P_pPrivKeyLen = P_RandomLen;

    /* Now compute the public key */
    retval = cmox_ecdh(&ecc_ctx,                                     /* ECC context */
                       CMOX_ECC_CURVE25519,                          /* CURVE25519 ECC curve selected */
                       P_pPrivKey, *P_pPrivKeyLen,                   /* Local Private key */
                       x25519_base_point, sizeof(x25519_base_point), /* Remote Public key */
                       P_pPubKey, P_pPubKeyLen);                     /* Data buffer to receive shared secret */

exit:
    return retval;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static cmox_ecc_retval_t do_ecc_key_gen(sid_pal_ecc_key_gen_params_t * const params)
{
    cmox_ecc_retval_t retval = CMOX_ECC_ERR_INTERNAL;
    sid_error_t       sid_err;

    switch (params->algo)
    {
        case SID_PAL_EDDSA_ED25519:
            {
                uint8_t random_data[CMOX_ECC_ED25519_PRIVKEY_LEN - CMOX_ECC_ED25519_PUBKEY_LEN];

                do
                {
                    sid_err = stm32wba_crypto_rand(random_data, sizeof(random_data));
                    if (sid_err != SID_ERROR_NONE)
                    {
                        retval = CMOX_ECC_ERR_INTERNAL;
                        goto exit;
                    }

                    sid_err = stm32wba_crypto_obtain_hw_control();
                    if (sid_err != SID_ERROR_NONE)
                    {
                        retval = CMOX_ECC_ERR_INTERNAL;
                        goto exit;
                    }
                    cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));
                    retval = cmox_eddsa_keyGen(&ecc_ctx,
                                               CMOX_ECC_CURVE_ED25519,
                                               random_data, sizeof(random_data),
                                               params->prk, &(params->prk_size),
                                               params->puk, &(params->puk_size));
                    cmox_ecc_cleanup(&ecc_ctx);
                    stm32wba_crypto_release_hw_control();
                } while (CMOX_ECC_ERR_WRONG_RANDOM == retval);
            }
            break;

        case SID_PAL_ECDSA_SECP256R1:
        case SID_PAL_ECDH_SECP256R1:
            {
                uint8_t random_data[CMOX_ECC_SECP256R1_PRIVKEY_LEN];

                do
                {
                    sid_err = stm32wba_crypto_rand(random_data, sizeof(random_data));
                    if (sid_err != SID_ERROR_NONE)
                    {
                        retval = CMOX_ECC_ERR_INTERNAL;
                        goto exit;
                    }

                    sid_err = stm32wba_crypto_obtain_hw_control();
                    if (sid_err != SID_ERROR_NONE)
                    {
                        retval = CMOX_ECC_ERR_INTERNAL;
                        goto exit;
                    }
                    cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));
                    retval = cmox_ecdsa_keyGen(&ecc_ctx,
                                               CMOX_ECC_CURVE_SECP256R1,
                                               random_data, sizeof(random_data),
                                               params->prk, &(params->prk_size),
                                               params->puk, &(params->puk_size));
                    cmox_ecc_cleanup(&ecc_ctx);
                    stm32wba_crypto_release_hw_control();
                } while (CMOX_ECC_ERR_WRONG_RANDOM == retval);
            }
            break;

        case SID_PAL_ECDH_CURVE25519:
            {
                uint8_t random_data[CMOX_ECC_CURVE25519_PRIVKEY_LEN];

                do
                {
                    sid_err = stm32wba_crypto_rand(random_data, sizeof(random_data));
                    if (sid_err != SID_ERROR_NONE)
                    {
                        retval = CMOX_ECC_ERR_INTERNAL;
                        goto exit;
                    }

                    sid_err = stm32wba_crypto_obtain_hw_control();
                    if (sid_err != SID_ERROR_NONE)
                    {
                        retval = CMOX_ECC_ERR_INTERNAL;
                        goto exit;
                    }
                    cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));
                    retval = do_x25519_keygen(&ecc_ctx,
                                              random_data, sizeof(random_data),
                                              params->prk, &(params->prk_size),
                                              params->puk, &(params->puk_size));
                    cmox_ecc_cleanup(&ecc_ctx);
                    stm32wba_crypto_release_hw_control();
                } while (CMOX_ECC_ERR_WRONG_RANDOM == retval);
            }
            break;

        default:
            retval = CMOX_ECC_ERR_BAD_PARAMETERS;
            break;
    }

