TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
exit:
    return retval;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t stm32wba_crypto_ecc_dsa(sid_pal_dsa_params_t * const params)
{
    sid_error_t status = SID_ERROR_GENERIC;
    cmox_ecc_retval_t retval = CMOX_ECC_ERR_INTERNAL;

    switch (params->algo)
    {
        case SID_PAL_EDDSA_ED25519:
            if (SID_PAL_CRYPTO_VERIFY == params->mode)
            {
                status = stm32wba_crypto_obtain_hw_control();
                if (status != SID_ERROR_NONE)
                {
                    return status;
                }
                retval = do_ecc_dsa_verify(params);
                stm32wba_crypto_release_hw_control();

                if (retval != CMOX_ECC_AUTH_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("ECC verification ED25519. CMOX err: 0x%08x", retval);
                    status = SID_ERROR_GENERIC;
                }
                else
                {
                    status = SID_ERROR_NONE;
                }
            }
            else if (SID_PAL_CRYPTO_SIGN == params->mode)
            {
                status = stm32wba_crypto_obtain_hw_control();
                if (status != SID_ERROR_NONE)
                {
                    return status;
                }
                retval = do_ecc_dsa_sign(params);
                stm32wba_crypto_release_hw_control();

                if (retval != CMOX_ECC_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("ECC signing ED25519. CMOX err: 0x%08x", retval);
                    status = SID_ERROR_GENERIC;
                }
                else
                {
                    status = SID_ERROR_NONE;
                }
            }
            else
            {
                status = SID_ERROR_INVALID_ARGS;
            }
            break;

        case SID_PAL_ECDSA_SECP256R1:
            if (SID_PAL_CRYPTO_VERIFY == params->mode)
            {
                status = stm32wba_crypto_obtain_hw_control();
                if (status != SID_ERROR_NONE)
                {
                    return status;
                }
                retval = do_ecc_dsa_verify(params);
                stm32wba_crypto_release_hw_control();

                if (retval != CMOX_ECC_AUTH_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("ECC verification SECP256R1. CMOX err: 0x%08x", retval);
                    status = SID_ERROR_GENERIC;
                }
                else
                {
                    status = SID_ERROR_NONE;
                }
            }
            else if (SID_PAL_CRYPTO_SIGN == params->mode)
            {
                status = stm32wba_crypto_obtain_hw_control();
                if (status != SID_ERROR_NONE)
                {
                    return status;
                }
                retval = do_ecc_dsa_sign(params);
                stm32wba_crypto_release_hw_control();

                if (retval != CMOX_ECC_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("ECC signing SECP256R1. CMOX err: 0x%08x", retval);
                    status = SID_ERROR_GENERIC;
                }
                else
                {
                    status = SID_ERROR_NONE;
                }
            }
            else
            {
                status = SID_ERROR_INVALID_ARGS;
            }
            break;

        default:
            status = SID_ERROR_NOSUPPORT;
    }

    return status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t stm32wba_crypto_ecc_ecdh(sid_pal_ecdh_params_t * const params)
{
    sid_error_t status = SID_ERROR_GENERIC;
    cmox_ecc_retval_t retval = CMOX_ECC_ERR_INTERNAL;

    switch (params->algo)
    {
        case SID_PAL_ECDH_SECP256R1:
            {
                uint8_t computed_secret[CMOX_ECC_SECP256R1_SECRET_LEN];
                size_t computed_secret_sz;
                const size_t useful_secret_bytes = CMOX_ECC_SECP256R1_SECRET_LEN / 2u;

                /* Get xclusive access to CRC peripheral and configure it properly */
                status = stm32wba_crypto_obtain_hw_control();
                if (status != SID_ERROR_NONE)
                {
                    return status;
                }

                /* Construct a ECC context, specifying mathematics implementation and working buffer for later processing */
                /* Note: CMOX_ECC256_MATH_FUNCS refer to the default mathematics implementation
                 * selected in cmox_default_config.h. To use a specific implementation, user can
                 * directly choose:
                 * - CMOX_MATH_FUNCS_SMALL to select the mathematics small implementation
                 * - CMOX_MATH_FUNCS_FAST to select the mathematics fast implementation
                 * - CMOX_MATH_FUNCS_SUPERFAST256 to select the mathematics fast implementation optimized for 256 bits computation
                 */
                cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));

                /* Compute directly the shared secret passing all the needed parameters */
                /* Note: CMOX_ECC_CURVE_SECP256R1 refer to the default SECP256R1 definition
                 * selected in cmox_default_config.h. To use a specific definition, user can
                 * directly choose:
                 * - CMOX_ECC_SECP256R1_LOWMEM to select the low RAM usage definition (slower computing)
                 * - CMOX_ECC_SECP256R1_HIGHMEM to select the high RAM usage definition (faster computing)
                 */
                retval = cmox_ecdh(&ecc_ctx,                              /* ECC context */
                                   CMOX_ECC_CURVE_SECP256R1,              /* SECP256R1 ECC curve selected */
                                   params->prk, params->prk_size,         /* Local Private key */
                                   params->puk, params->puk_size,         /* Remote Public key */
                                   computed_secret, &computed_secret_sz); /* Data buffer to receive shared secret */

