TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
                /* Cleanup context */
                cmox_ecc_cleanup(&ecc_ctx);

                /* Restore CRC peripheral state and release the lock */
                stm32wba_crypto_release_hw_control();
                if (retval != CMOX_ECC_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("Failed to compute SECP256R1 ECC. CMOX error code: %08x", retval);
                    status = SID_ERROR_IO_ERROR;
                }
                else
                {
                    SID_PAL_ASSERT(CMOX_ECC_SECP256R1_SECRET_LEN == computed_secret_sz);
                    SID_STM32_UTIL_fast_memcpy(params->shared_secret, computed_secret, useful_secret_bytes);
                    params->shared_secret_sz = useful_secret_bytes;
                    status = SID_ERROR_NONE;
                }
            }
            break;

        case SID_PAL_ECDH_CURVE25519:
            status = stm32wba_crypto_obtain_hw_control();
            if (status != SID_ERROR_NONE)
            {
                return status;
            }
            cmox_ecc_construct(&ecc_ctx, CMOX_ECC256_MATH_FUNCS, working_buffer, sizeof(working_buffer));
            retval = cmox_ecdh(&ecc_ctx,                                          /* ECC context */
                               CMOX_ECC_CURVE25519,                               /* CURVE25519 ECC curve selected */
                               params->prk, params->prk_size,                     /* Local Private key */
                               params->puk, params->puk_size,                     /* Remote Public key */
                               params->shared_secret, &params->shared_secret_sz); /* Data buffer to receive shared secret */
            cmox_ecc_cleanup(&ecc_ctx);
            stm32wba_crypto_release_hw_control();

            if (retval != CMOX_ECC_SUCCESS)
            {
                SID_PAL_LOG_ERROR("Failed to compute CURVE25519 ECC. CMOX error code: %08x", retval);
                status = SID_ERROR_IO_ERROR;
            }
            else
            {
                status = SID_ERROR_NONE;
            }
            break;

        default:
            retval = CMOX_ECC_ERR_BAD_PARAMETERS;
            status = SID_ERROR_NOSUPPORT;
    }

    return status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t stm32wba_crypto_ecc_key_gen(sid_pal_ecc_key_gen_params_t * const params)
{
    sid_error_t status = SID_ERROR_GENERIC;
    cmox_ecc_retval_t retval;
    size_t ecc_prk_sz = 0u, ecc_puk_sz = 0u;

    switch (params->algo)
    {
        case SID_PAL_EDDSA_ED25519:
            ecc_prk_sz = CMOX_ECC_ED25519_PRIVKEY_LEN - CMOX_ECC_ED25519_PUBKEY_LEN; /* Store only private part of the key pair */
            ecc_puk_sz = CMOX_ECC_ED25519_PUBKEY_LEN;
            break;

        case SID_PAL_ECDSA_SECP256R1:
        case SID_PAL_ECDH_SECP256R1:
            ecc_prk_sz = CMOX_ECC_SECP256R1_PRIVKEY_LEN;
            ecc_puk_sz = CMOX_ECC_SECP256R1_PUBKEY_LEN;
        break;

        case SID_PAL_ECDH_CURVE25519:
            ecc_prk_sz = CMOX_ECC_CURVE25519_PRIVKEY_LEN;
            ecc_puk_sz = CMOX_ECC_CURVE25519_PUBKEY_LEN;
            break;

        default:
            return SID_ERROR_NOSUPPORT;
    }

    if ((ecc_prk_sz != params->prk_size) || (ecc_puk_sz != params->puk_size))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    retval = do_ecc_key_gen(params);
    if (retval != CMOX_ECC_SUCCESS)
    {
        SID_PAL_LOG_ERROR("Unable to generate crypto key pair. CMOX error: 0x%08x", retval);
        status = SID_ERROR_IO_ERROR;
    }
    else
    {
        status = SID_ERROR_NONE;
    }

    return status;
}

/* Global function definitions -----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_init()
{
    if (hal_init_done != false)
    {
        return SID_ERROR_NONE;
    }

    sid_error_t ret = stm32wba_crypto_init();
    if (ret != SID_ERROR_NONE)
    {
        return ret;
    }

    hal_init_done = true;

    uint32_t seed = 0u;
    ret = sid_pal_crypto_rand((uint8_t*)&seed, sizeof(seed));
    if (SID_ERROR_NONE == ret)
    {
        srand(seed);
    }
    else
    {
        hal_init_done = false;
    }

    return ret;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_deinit(void)
{
    sid_error_t ret = stm32wba_crypto_deinit();
    if (ret != SID_ERROR_NONE)
    {
        return ret;
    }
    else
    {
        hal_init_done = false;
        return SID_ERROR_NONE;
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_rand(uint8_t* rand, size_t size)
{
    if (!hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == rand) || (0u == size))
    {
        return SID_ERROR_NULL_POINTER;
    }

    return stm32wba_crypto_rand(rand, size);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_hash(sid_pal_hash_params_t* params)
{
    cmox_hash_retval_t retval;

    if (false == hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == params) || (NULL == params->data) || (NULL == params->digest))
    {
        return SID_ERROR_NULL_POINTER;
    }

    if ((0u == params->data_size) || (0u == params->digest_size))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    retval = stm32wba_crypto_hash(params);
    return retval == CMOX_HASH_SUCCESS ? SID_ERROR_NONE : SID_ERROR_GENERIC;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_hmac(sid_pal_hmac_params_t* params)
{
    if (false == hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == params) || (NULL == params->key) || (NULL == params->data) || (NULL == params->digest))
    {
        return SID_ERROR_NULL_POINTER;
    }

    return stm32wba_crypto_hmac(params);
}

