TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/crypto.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_aes_crypt(sid_pal_aes_params_t* params)
{
    if (false == hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == params) || (NULL == params->key) || (NULL == params->in) || (NULL == params->out))
    {
        return SID_ERROR_NULL_POINTER;
    }

    if (0u == params->in_size)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    return stm32wba_crypto_aes_crypt(params);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_aead_crypt(sid_pal_aead_params_t* params)
{
    if (false == hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == params) || (NULL == params->key) || (NULL == params->in) || (NULL == params->out))
    {
        return SID_ERROR_NULL_POINTER;
    }

    if ((0u == params->in_size) || (0u == params->aad_size))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    return stm32wba_crypto_aead_crypt(params);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_ecc_dsa(sid_pal_dsa_params_t* params)
{
    if (false == hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == params) || (NULL == params->key) || (NULL == params->in) || (NULL == params->signature))
    {
        return SID_ERROR_NULL_POINTER;
    }

    if (0u == params->in_size)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    return stm32wba_crypto_ecc_dsa(params);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_ecc_ecdh(sid_pal_ecdh_params_t* params)
{
    if (false == hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == params) || (NULL == params->prk) || (NULL == params->puk) || (NULL == params->shared_secret))
    {
        return SID_ERROR_NULL_POINTER;
    }

    return stm32wba_crypto_ecc_ecdh(params);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_crypto_ecc_key_gen(sid_pal_ecc_key_gen_params_t* params)
{
    if (false == hal_init_done)
    {
        return SID_ERROR_UNINITIALIZED;
    }

    if ((NULL == params) || (NULL == params->prk) || (NULL == params->puk))
    {
        return SID_ERROR_NULL_POINTER;
    }

    return stm32wba_crypto_ecc_key_gen(params);
}
